posts/build.org
#+title: Using a Blog post as build instructions
#+PROPERTY: header-args :tangle ../build.el

/I will be continually updating and editing this blog post as I grow this website so consider this to be a small forever post./


** The why

I had an interesting thought as I was switching my website away from using hugo as the static site generator to using org-publish. Why not try and use the literal programming feature of Org to have the actual build instructions for org-publish as an actual blog post.

Now why org-publish?

Well because [[https://orgmode.org/][org mode]] is the only decent way of writing documents without going /insane/.

The real reason is that one of the many fantastic things about org mode is the ability to write blocks of code in many different languages, and execute them all in the same session, a superior Jupyter notebook but for all languages. This comes in handy when you are engaging in exploratory work which is often what I do. Therefore, compiling it into a blog post becomes the natural next step and I just have to move the file over and /walla/ its there, ready to be published.

This specific site uses this blog post, a shell script and github pages to actually build and host the website.

/I do have a few other files that I need to move over such as assets, the preamble and postamble to this blog post/

** Packages

Set the packages into a hidden folder
#+begin_src emacs-lisp
(require 'package)
(setq package-user-dir (expand-file-name "./.packages"))
(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("elpa" . "https://elpa.gnu.org/packages/")))
#+end_src

Initialise the package system
#+begin_src emacs-lisp
(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))
#+end_src

Install dependencies
#+begin_src emacs-lisp
(package-install 'htmlize)
#+end_src

Load the publishing system
#+begin_src emacs-lisp
(require 'ox-publish)
#+end_src

** Setting the stylesheets
To set the css style sheets in the HTML-HEAD.
#+begin_src emacs-lisp
(setq set-css "<link rel=\"stylesheet\" type=\"text/css\" href=\"/asset/css/style.css\"/><link rel=\"stylesheet\" href=\"/asset/css/prism.css\"/><script src=\"/asset/js/prism.js\"></script><link rel=\"alternate\" type=\"application/rss+xml\" title=\"RSS Feed\" href=\"/feed.xml\">")
#+end_src

