posts/build.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Using a Blog post as build instructions</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/asset/css/style.css"/><link rel="stylesheet" href="/asset/css/prism.css"/><link rel="alternate" type="application/rss+xml" title="RSS Feed" href="/feed.xml">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Using a Blog post as build instructions</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga2d22bd">The why</a></li>
<li><a href="#org60d7914">Packages</a></li>
<li><a href="#orgf896d09">Setting the stylesheets</a></li>
<li><a href="#orgedf3423">Editing the backend configuration functions</a></li>
<li><a href="#orgba998e6">RSS Feed Generation</a></li>
</ul>
</div>
</div>
<p>
<i>I will be continually updating and editing this blog post as I grow this website so consider this to be a small forever post.</i>
</p>
<div id="outline-container-orga2d22bd" class="outline-2">
<h2 id="orga2d22bd">The why</h2>
<div class="outline-text-2" id="text-orga2d22bd">
<p>
I had an interesting thought as I was switching my website away from using hugo as the static site generator to using org-publish. Why not try and use the literal programming feature of Org to have the actual build instructions for org-publish as an actual blog post.
</p>

<p>
Now why org-publish?
</p>

<p>
Well because <a href="https://orgmode.org/">org mode</a> is the only decent way of writing documents without going <i>insane</i>.
</p>

<p>
The real reason is that one of the many fantastic things about org mode is the ability to write blocks of code in many different languages, and execute them all in the same session, a superior Jupyter notebook but for all languages. This comes in handy when you are engaging in exploratory work which is often what I do. Therefore, compiling it into a blog post becomes the natural next step and I just have to move the file over and <i>walla</i> its there, ready to be published.
</p>

<p>
This specific site uses this blog post, a shell script and github pages to actually build and host the website.
</p>

<p>
<i>I do have a few other files that I need to move over such as assets, the preamble and postamble to this blog post</i>
</p>
</div>
</div>
<div id="outline-container-org60d7914" class="outline-2">
<h2 id="org60d7914">Packages</h2>
<div class="outline-text-2" id="text-org60d7914">
<p>
Set the packages into a hidden folder
</p>
<div class="org-src-container">
<pre><code class="src language-emacs-lisp">(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">package</span>)
(<span style="font-weight: bold;">setq</span> package-user-dir (expand-file-name <span style="font-style: italic;">"./.packages"</span>))
(<span style="font-weight: bold;">setq</span> package-archives '((<span style="font-style: italic;">"melpa"</span> . <span style="font-style: italic;">"https://melpa.org/packages/"</span>)
                         (<span style="font-style: italic;">"elpa"</span> . <span style="font-style: italic;">"https://elpa.gnu.org/packages/"</span>)))
</code></pre>
</div>

<p>
Initialise the package system
</p>
<div class="org-src-container">
<pre><code class="src language-emacs-lisp">(package-initialize)
(<span style="font-weight: bold;">unless</span> package-archive-contents
  (package-refresh-contents))
</code></pre>
</div>

<p>
Install dependencies
</p>
<div class="org-src-container">
<pre><code class="src language-emacs-lisp">(package-install 'htmlize)
</code></pre>
</div>

<p>
Load the publishing system
</p>
<div class="org-src-container">
<pre><code class="src language-emacs-lisp">(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">ox-publish</span>)
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orgf896d09" class="outline-2">
<h2 id="orgf896d09">Setting the stylesheets</h2>
<div class="outline-text-2" id="text-orgf896d09">
<p>
To set the css style sheets in the HTML-HEAD.
</p>
<div class="org-src-container">
<pre><code class="src language-emacs-lisp">(<span style="font-weight: bold;">setq</span> set-css <span style="font-style: italic;">"&lt;link rel=\"stylesheet\" type=\"text/css\" href=\"/asset/css/style.css\"/&gt;&lt;link rel=\"stylesheet\" href=\"/asset/css/prism.css\"/&gt;&lt;script src=\"/asset/js/prism.js\"&gt;&lt;/script&gt;&lt;link rel=\"alternate\" type=\"application/rss+xml\" title=\"RSS Feed\" href=\"/feed.xml\"&gt;"</span>)
</code></pre>
</div>
</div>
</div>
