posts/build.html
<div id="outline-container-orgedf3423" class="outline-2">
<h2 id="orgedf3423">Editing the backend configuration functions</h2>
<div class="outline-text-2" id="text-orgedf3423">
<p>
This overrides the default back-end filter for the <code>src-block</code> and changes the HTML template. This will also change the class to match Prism’s recommendations, which is language-*, where * is the language.
</p>

<p>
This code is originally from <a href="https://roygbyte.com/add_syntax_highlighting_to_an_org_publish_project.html">here</a>
</p>
<div class="org-src-container">
<pre><code class="src language-emacs-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">my/org-html-src-block</span> (src-block _contents info)
  <span style="font-style: italic;">"Transcode a SRC-BLOCK element from Org to HTML.
  CONTENTS holds the contents of the item.  INFO is a plist holding
  contextual information."</span>
  (<span style="font-weight: bold;">if</span> (org-export-read-attribute <span style="font-weight: bold;">:attr_html</span> src-block <span style="font-weight: bold;">:textarea</span>)
      (org-html--textarea-block src-block)
    (<span style="font-weight: bold;">let*</span> ((lang (org-element-property <span style="font-weight: bold;">:language</span> src-block))
           (code (org-html-format-code src-block info))
           (label (<span style="font-weight: bold;">let</span> ((lbl (org-html--reference src-block info t)))
                    (<span style="font-weight: bold;">if</span> lbl (format <span style="font-style: italic;">" id=\"%s\""</span> lbl) <span style="font-style: italic;">""</span>)))
           (klipsify  (<span style="font-weight: bold;">and</span>  (plist-get info <span style="font-weight: bold;">:html-klipsify-src</span>)
                            (member lang '(<span style="font-style: italic;">"javascript"</span> <span style="font-style: italic;">"js"</span>
                                           <span style="font-style: italic;">"python"</span> <span style="font-style: italic;">"scheme"</span> <span style="font-style: italic;">"clojure"</span> <span style="font-style: italic;">"php"</span> <span style="font-style: italic;">"html"</span> <span style="font-style: italic;">"shell"</span> <span style="font-style: italic;">"rust"</span>)))))
      (<span style="font-weight: bold;">if</span> (not lang) (format <span style="font-style: italic;">"&lt;pre class=\"example\"%s&gt;\n%s&lt;/pre&gt;"</span> label code)
        (format <span style="font-style: italic;">"&lt;div class=\"org-src-container\"&gt;\n%s%s\n&lt;/div&gt;"</span>
                (<span style="font-weight: bold;">let</span> ((caption (org-export-get-caption src-block)))
                  (<span style="font-weight: bold;">if</span> (not caption) <span style="font-style: italic;">""</span>
                    (<span style="font-weight: bold;">let</span> ((listing-number
                           (format
                            <span style="font-style: italic;">"&lt;span class=\"listing-number\"&gt;%s &lt;/span&gt;"</span>
                            (format
                             (org-html--translate <span style="font-style: italic;">"Listing %d:"</span> info)
                             (org-export-get-ordinal
                              src-block info nil #'org-html--has-caption-p)))))
                      (format <span style="font-style: italic;">"&lt;label class=\"org-src-name\"&gt;%s%s&lt;/label&gt;"</span>
                              listing-number
                              (org-trim (org-export-data caption info))))))
                (<span style="font-weight: bold;">if</span> klipsify
                    (format <span style="font-style: italic;">"&lt;pre&gt;&lt;code class=\"src language-%s\"%s%s&gt;%s&lt;/code&gt;&lt;/pre&gt;"</span>
                            lang
                            label
                            (<span style="font-weight: bold;">if</span> (string= lang <span style="font-style: italic;">"html"</span>)
                                <span style="font-style: italic;">" data-editor-type=\"html\""</span>
                              <span style="font-style: italic;">""</span>)
                            code)
                  (format <span style="font-style: italic;">"&lt;pre&gt;&lt;code class=\"src language-%s\"%s&gt;%s&lt;/code&gt;&lt;/pre&gt;"</span>
                          lang label code)))))))
</code></pre>
</div>

<p>
Next, a new backend that includes the new filter needs to be defined. According to org-mode’s documentation, we can do that by calling <code>org-export-define-derived-backend</code>, specifying the derived backend’s name and the derived backend’s parent as the first and second parameter, and modifying the <code>:translate-alist</code> property to include the new filter.
</p>
<div class="org-src-container">
<pre><code class="src language-emacs-lisp">(org-export-define-derived-backend 'site-html
                                   'html
                                   <span style="font-weight: bold;">:translate-alist</span>
                                   '((src-block . my/org-html-src-block)))
</code></pre>
</div>

<p>
Customise the HTML output by using our own scripts and styles without showing our validations links
</p>
<div class="org-src-container">
<pre><code class="src language-emacs-lisp">(<span style="font-weight: bold;">setq</span> org-html-validation-link nil org-html-head-include-scripts nil
      org-html-head-include-default-style nil
      org-html-head set-css)
</code></pre>
</div>

<p>
This is a wrapper function editing the original <code>org-publish-to-html</code> function. It publishes the file only if it contains the line '#+SELECT<sub>TAGS</sub>: publish'.
</p>
<div class="org-src-container">
<pre><code class="src language-emacs-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">my/org-publish</span> (plist filename pub-dir)
  <span style="font-style: italic;">"Publish the file only if it contains the line '#+SELECT_TAGS: publish'."</span>
        (org-publish-org-to 'site-html filename
                            (concat (<span style="font-weight: bold;">when</span> (&gt; (length org-html-extension) 0) <span style="font-style: italic;">"."</span>)
                                    (<span style="font-weight: bold;">or</span> (plist-get plist <span style="font-weight: bold;">:html-extension</span>)
                                        org-html-extension
                                        <span style="font-style: italic;">"html"</span>))
                            plist pub-dir))
</code></pre>
</div>
</div>
</div>
