posts/build.html
<div id="outline-container-orgba998e6" class="outline-2">
<h2 id="orgba998e6">RSS Feed Generation</h2>
<div class="outline-text-2" id="text-orgba998e6">
<p>
Someone asked if I had an rss feed to my blog and my answer to that question is "yes I do now". It was not too hard to add RSS functionality to my blog, as all I needed to do was add a few more additional functions to this specific blog post and then publish it.
</p>


<p>
This function takes the cleaned post content and extracts the first 3 sentences, truncating to 200 characters if needed.
</p>

<div class="org-src-container">
<pre><code class="src language-emacs-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">my/extract-description</span> (content)
  <span style="font-style: italic;">"Extract first few sentences from post content for RSS description."</span>
  (<span style="font-weight: bold;">let*</span> ((sentences (split-string content <span style="font-style: italic;">"[.!?]"</span> t))
         (first-sentences (cl-subseq sentences 0 (min 3 (length sentences))))
         (description (string-join first-sentences <span style="font-style: italic;">". "</span>)))
    (<span style="font-weight: bold;">if</span> (&gt; (length description) 200)
        (concat (substring description 0 197) <span style="font-style: italic;">"..."</span>)
      (concat description <span style="font-style: italic;">"."</span>))))
</code></pre>
</div>

<p>
This function extracts the title and date from org headers, finds where the actual content starts (either after the first heading or after the title), and then extracts clean content while skipping org-specific syntax like properties drawers, directives, and headings.
</p>
<div class="org-src-container">
<pre><code class="src language-emacs-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">my/get-post-metadata</span> (file-path)
  <span style="font-style: italic;">"Extract title, date and clean content from org file."</span>
  (<span style="font-weight: bold;">with-temp-buffer</span>
    (insert-file-contents file-path)
    (<span style="font-weight: bold;">let</span> ((title nil)
          (date nil)
          (content-start nil)
          (clean-content <span style="font-style: italic;">""</span>))
      (goto-char (point-min))
      (<span style="font-weight: bold;">when</span> (re-search-forward <span style="font-style: italic;">"^#\\+TITLE:\\s-+</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">(</span><span style="font-style: italic;">.+</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">)</span><span style="font-style: italic;">$"</span> nil t)
        (<span style="font-weight: bold;">setq</span> title (match-string 1)))
      (goto-char (point-min))
      (<span style="font-weight: bold;">when</span> (re-search-forward <span style="font-style: italic;">"^#\\+DATE:\\s-+</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">(</span><span style="font-style: italic;">.+</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">)</span><span style="font-style: italic;">$"</span> nil t)
        (<span style="font-weight: bold;">setq</span> date (match-string 1)))

      (<span style="font-weight: bold;">cond</span> 
       ((re-search-forward <span style="font-style: italic;">"^\\*+\\s-+"</span> nil t)
        (forward-line 1)
        (<span style="font-weight: bold;">setq</span> content-start (point)))
       ((re-search-forward <span style="font-style: italic;">"^#\\+title:"</span> nil t)
        (forward-line 1)
        (<span style="font-weight: bold;">setq</span> content-start (point)))
       (t
        (<span style="font-weight: bold;">setq</span> content-start (point-min))))

      (<span style="font-weight: bold;">let</span> ((in-properties nil))
        (<span style="font-weight: bold;">when</span> content-start
          (goto-char content-start)
          (<span style="font-weight: bold;">while</span> (not (eobp))
            (<span style="font-weight: bold;">let</span> ((line (buffer-substring-no-properties (point-at-bol) (point-at-eol))))
              (<span style="font-weight: bold;">cond</span>
               ((string-match-p <span style="font-style: italic;">"^\\s-*:PROPERTIES:"</span> line)
                (<span style="font-weight: bold;">setq</span> in-properties t))
               ((string-match-p <span style="font-style: italic;">"^\\s-*:END:"</span> line)
                (<span style="font-weight: bold;">setq</span> in-properties nil))
               ((<span style="font-weight: bold;">and</span> (not in-properties)
                     (not (string-match-p <span style="font-style: italic;">"^#\\+"</span> line))
                     (not (string-match-p <span style="font-style: italic;">"^\\s-*$"</span> line))
                     (not (string-match-p <span style="font-style: italic;">"^\\*"</span> line)))
                (<span style="font-weight: bold;">setq</span> clean-content (concat clean-content line <span style="font-style: italic;">" "</span>)))))
            (forward-line 1))
          (<span style="font-weight: bold;">setq</span> clean-content (replace-regexp-in-string <span style="font-style: italic;">"\\s-+"</span> <span style="font-style: italic;">" "</span> clean-content))
          (<span style="font-weight: bold;">setq</span> clean-content (string-trim clean-content))))

      (list <span style="font-weight: bold;">:title</span> title <span style="font-weight: bold;">:date</span> date <span style="font-weight: bold;">:file</span> file-path <span style="font-weight: bold;">:content</span> clean-content))))
</code></pre>
</div>


<p>
This function processes all org files in the posts directory, extracts their metadata and content, and generates a valid RSS 2.0 XML feed with proper formatting and auto-discovery links.
</p>
<div class="org-src-container">
<pre><code class="src language-emacs-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">my/generate-rss-feed</span> ()
  <span style="font-style: italic;">"Generate RSS feed from all posts."</span>
  (<span style="font-weight: bold;">let*</span> ((posts-dir <span style="font-style: italic;">"./posts"</span>)
         (rss-file <span style="font-style: italic;">"./public/feed.xml"</span>)
         (base-url <span style="font-style: italic;">"https://hamzahamud.com"</span>)
         (posts (directory-files posts-dir t <span style="font-style: italic;">"\\.org$"</span>))
         (rss-items nil))

    (<span style="font-weight: bold;">dolist</span> (post posts)
      (<span style="font-weight: bold;">unless</span> (string-match-p <span style="font-style: italic;">"posts.org"</span> post)
        (<span style="font-weight: bold;">let*</span> ((metadata (my/get-post-metadata post))
               (title (plist-get metadata <span style="font-weight: bold;">:title</span>))
               (date (plist-get metadata <span style="font-weight: bold;">:date</span>))
               (content (plist-get metadata <span style="font-weight: bold;">:content</span>))
               (filename (file-name-base post))
               (url (concat base-url <span style="font-style: italic;">"/posts/"</span> filename <span style="font-style: italic;">".html"</span>)))

          (<span style="font-weight: bold;">when</span> (<span style="font-weight: bold;">and</span> title content)
            (<span style="font-weight: bold;">push</span> (list <span style="font-weight: bold;">:title</span> title 
                       <span style="font-weight: bold;">:date</span> (<span style="font-weight: bold;">or</span> date (format-time-string <span style="font-style: italic;">"%Y-%m-%d"</span>))
                       <span style="font-weight: bold;">:url</span> url
                       <span style="font-weight: bold;">:description</span> (my/extract-description content))
                  rss-items)))))

    (<span style="font-weight: bold;">with-temp-buffer</span>
      (insert <span style="font-style: italic;">"&lt;?xml version=\"1.0\" encoding=\"UTF-8\"?&gt;\n"</span>)
      (insert <span style="font-style: italic;">"&lt;rss version=\"2.0\" xmlns:atom=\"http://www.w3.org/2005/Atom\"&gt;\n"</span>)
      (insert <span style="font-style: italic;">"&lt;channel&gt;\n"</span>)
      (insert <span style="font-style: italic;">"&lt;title&gt;Hamza Hamud&lt;/title&gt;\n"</span>)
      (insert <span style="font-style: italic;">"&lt;link&gt;"</span> base-url <span style="font-style: italic;">"&lt;/link&gt;\n"</span>)
      (insert <span style="font-style: italic;">"&lt;description&gt;Software Developer | GNU Emacs Hacker | Hobbiest&lt;/description&gt;\n"</span>)
      (insert <span style="font-style: italic;">"&lt;language&gt;en-us&lt;/language&gt;\n"</span>)
      (insert <span style="font-style: italic;">"&lt;lastBuildDate&gt;"</span> (format-time-string <span style="font-style: italic;">"%a, %d %b %Y %H:%M:%S %z"</span>) <span style="font-style: italic;">"&lt;/lastBuildDate&gt;\n"</span>)
      (insert <span style="font-style: italic;">"&lt;atom:link href=\""</span> base-url <span style="font-style: italic;">"/feed.xml\" rel=\"self\" type=\"application/rss+xml\" /&gt;\n"</span>)

      (<span style="font-weight: bold;">dolist</span> (item (reverse rss-items))
        (insert <span style="font-style: italic;">"&lt;item&gt;\n"</span>)
        (insert <span style="font-style: italic;">"&lt;title&gt;"</span> (plist-get item <span style="font-weight: bold;">:title</span>) <span style="font-style: italic;">"&lt;/title&gt;\n"</span>)
        (insert <span style="font-style: italic;">"&lt;link&gt;"</span> (plist-get item <span style="font-weight: bold;">:url</span>) <span style="font-style: italic;">"&lt;/link&gt;\n"</span>)
        (insert <span style="font-style: italic;">"&lt;guid isPermaLink=\"true\"&gt;"</span> (plist-get item <span style="font-weight: bold;">:url</span>) <span style="font-style: italic;">"&lt;/guid&gt;\n"</span>)
        (insert <span style="font-style: italic;">"&lt;description&gt;&lt;![CDATA["</span> (plist-get item <span style="font-weight: bold;">:description</span>) <span style="font-style: italic;">"]]&gt;&lt;/description&gt;\n"</span>)
        (insert <span style="font-style: italic;">"&lt;pubDate&gt;"</span> (plist-get item <span style="font-weight: bold;">:date</span>) <span style="font-style: italic;">"&lt;/pubDate&gt;\n"</span>)
        (insert <span style="font-style: italic;">"&lt;/item&gt;\n"</span>))

      (insert <span style="font-style: italic;">"&lt;/channel&gt;\n"</span>)
      (insert <span style="font-style: italic;">"&lt;/rss&gt;\n"</span>)

      (write-region (point-min) (point-max) rss-file))))
</code></pre>
</div>

<p>
This wrapper function ensures that the RSS feed is regenerated every time a file is published, keeping the feed up to date with the latest posts.
</p>
<div class="org-src-container">
<pre><code class="src language-emacs-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">my/publish-with-rss</span> (plist filename pub-dir)
  <span style="font-style: italic;">"Publish file and regenerate RSS feed."</span>
  (my/org-publish plist filename pub-dir)
  (my/generate-rss-feed))
</code></pre>
</div>

<p>
This configuration defines the publishing projects for posts, pages, and static assets, using the RSS-aware publishing function to ensure feeds are updated automatically.
</p>
<div class="org-src-container">
<pre><code class="src language-emacs-lisp">(<span style="font-weight: bold;">setq</span> org-publish-project-alist
      (list

       (list <span style="font-style: italic;">"posts"</span>
             <span style="font-weight: bold;">:recursive</span> nil
             <span style="font-weight: bold;">:base-directory</span> <span style="font-style: italic;">"./posts"</span>
             <span style="font-weight: bold;">:publishing-function</span> 'my/publish-with-rss
             <span style="font-weight: bold;">:publishing-directory</span> <span style="font-style: italic;">"./public/posts"</span>
             <span style="font-weight: bold;">:with-email</span> nil
             <span style="font-weight: bold;">:auto-sitemap</span> t
             <span style="font-weight: bold;">:sitemap-title</span> <span style="font-style: italic;">"posts"</span>
             <span style="font-weight: bold;">:sitemap-filename</span> <span style="font-style: italic;">"posts.org"</span>
             <span style="font-weight: bold;">:with-creator</span> t
             <span style="font-weight: bold;">:with-author</span> nil
             <span style="font-weight: bold;">:with-toc</span> t
             <span style="font-weight: bold;">:section-numbers</span> nil
             <span style="font-weight: bold;">:time-stamp-file</span> nil)
       (list <span style="font-style: italic;">"pages"</span>
             <span style="font-weight: bold;">:recursive</span> nil
             <span style="font-weight: bold;">:exclude</span> <span style="font-style: italic;">"README.org"</span>
             <span style="font-weight: bold;">:base-directory</span> <span style="font-style: italic;">"./"</span>
             <span style="font-weight: bold;">:publishing-function</span> 'my/publish-with-rss
             <span style="font-weight: bold;">:publishing-directory</span> <span style="font-style: italic;">"./public/"</span>
             <span style="font-weight: bold;">:with-email</span> nil
             <span style="font-weight: bold;">:with-creator</span> t
             <span style="font-weight: bold;">:with-author</span> nil
             <span style="font-weight: bold;">:with-toc</span> t
             <span style="font-weight: bold;">:section-numbers</span> nil
             <span style="font-weight: bold;">:time-stamp-file</span> nil)

       (list <span style="font-style: italic;">"static"</span>
         <span style="font-weight: bold;">:base-directory</span> <span style="font-style: italic;">"./"</span>
         <span style="font-weight: bold;">:base-extension</span> <span style="font-style: italic;">"css</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">txt</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">jpg</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">gif</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">png</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">js"</span>
         <span style="font-weight: bold;">:recursive</span> t
         <span style="font-weight: bold;">:publishing-directory</span>  <span style="font-style: italic;">"./public"</span>
         <span style="font-weight: bold;">:publishing-function</span> 'org-publish-attachment)

       (list <span style="font-style: italic;">"site"</span> <span style="font-weight: bold;">:components</span> (list <span style="font-style: italic;">"pages"</span> <span style="font-style: italic;">"static"</span> <span style="font-style: italic;">"posts"</span>))
))
</code></pre>
</div>

<p>
This final step publishes all content and generates the RSS feed to ensure everything is up to date.
</p>
<div class="org-src-container">
<pre><code class="src language-emacs-lisp">(org-publish-all t)
(my/generate-rss-feed)
</code></pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.2 (<a href="https://orgmode.org">Org</a> mode 9.7.11)</p>
</div>
</body>
</html>
